In [1]:
import pandas as pd
d = {"Name":["Rohit","Rahul"],"Team":"india"}

In [2]:
d

{'Name': ['Rohit', 'Rahul'], 'Team': 'india'}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

    Name   Team
0  Rohit  india
1  Rahul  india

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
dc = df["Name"]
dc

0    Rohit
1    Rahul
Name: Name, dtype: object

In [7]:
df.Name

0    Rohit
1    Rahul
Name: Name, dtype: object

In [9]:
df.shape[1]

2

In [10]:
type(df.shape)

tuple

In [11]:
df.columns

Index(['Name', 'Team'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [13]:
data = {'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
     'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai',
              'Manchester', 'Cairo', 'Osaka'],
     'age': [41, 28, 33, 34, 38, 31, 37],
     'pyscore': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]}

In [14]:
import pandas as pd 
pf = pd.DataFrame(data)
pf

     name         city  age  pyscore
0  Xavier  Mexico City   41     88.0
1     Ann      Toronto   28     79.0
2    Jana       Prague   33     81.0
3      Yi     Shanghai   34     80.0
4   Robin   Manchester   38     68.0
5    Amal        Cairo   31     61.0
6    Nori        Osaka   37     84.0

In [15]:
pf.index

RangeIndex(start=0, stop=7, step=1)

In [16]:
a = []
a = pf["name"].values
type(a)

numpy.ndarray

In [17]:
pf.iloc[1][1]

'Toronto'

In [18]:
pf[pf["pyscore"] >80]["pyscore"]

0    88.0
2    81.0
6    84.0
Name: pyscore, dtype: float64

In [19]:
nam,score = pf[["name","pyscore"]][pf["pyscore"].max() == pf["pyscore"]]
score

'pyscore'

In [20]:
pf

     name         city  age  pyscore
0  Xavier  Mexico City   41     88.0
1     Ann      Toronto   28     79.0
2    Jana       Prague   33     81.0
3      Yi     Shanghai   34     80.0
4   Robin   Manchester   38     68.0
5    Amal        Cairo   31     61.0
6    Nori        Osaka   37     84.0

 *If we access one cell value without using ":" then it will be basic data type 
 __________________pf.loc[0,'name'])_________
 
*If we access one cell value using ":" in  only on one of the arguments then it will be series(multi row || column with single row||column
___pf.loc[0,'name':'name'])________,______type(pf.loc[0:0,'name']____
instead of series if we want dataframe we have to use "[[]]" in first argument without using ":"
__type(pf.loc[[0]],'name'])

*If we access one cell value using ":" in  both the arguments then it will be dataframe((multi row  with multi column)
__type(pf.loc[0:1,'name':'age'])

__Same for iloc__

__Note__We can also Access a value (Cell) in a dataframe by using list based accessing technique
EX:pf.iloc[0][0] and pf.loc[0][0]

In [21]:
type(pf.loc[0,'age'])

#pf.loc[0:1,'name':'age']
series = pf.loc[:,"name":"name"]
type(series)
series.shape

(7, 1)

In [22]:
pf.loc[0:,'name']

0    Xavier
1       Ann
2      Jana
3        Yi
4     Robin
5      Amal
6      Nori
Name: name, dtype: object

In [23]:
pf.loc[[True,False,True,False,True,False,False]]

     name         city  age  pyscore
0  Xavier  Mexico City   41     88.0
2    Jana       Prague   33     81.0
4   Robin   Manchester   38     68.0

In [24]:
pf

     name         city  age  pyscore
0  Xavier  Mexico City   41     88.0
1     Ann      Toronto   28     79.0
2    Jana       Prague   33     81.0
3      Yi     Shanghai   34     80.0
4   Robin   Manchester   38     68.0
5    Amal        Cairo   31     61.0
6    Nori        Osaka   37     84.0

In [25]:
type(pf.iloc[0,0])

str

In [26]:
pf.iloc[1:3,2:4]

   age  pyscore
1   28     79.0
2   33     81.0

In [27]:
pf["name"]

0    Xavier
1       Ann
2      Jana
3        Yi
4     Robin
5      Amal
6      Nori
Name: name, dtype: object

*Modifying the dataframe values

In [28]:
pf.iloc[1,2] = 42
pf

     name         city  age  pyscore
0  Xavier  Mexico City   41     88.0
1     Ann      Toronto   42     79.0
2    Jana       Prague   33     81.0
3      Yi     Shanghai   34     80.0
4   Robin   Manchester   38     68.0
5    Amal        Cairo   31     61.0
6    Nori        Osaka   37     84.0

In [29]:
#To modify a value based on index we can use __pf.iloc[i,3] or pf.iat[i,3] or pf.loc[i,"pyscore"] or pf.at[i,"pyscore"]
#For efficient performance we need to use .iat[int,int] or .at[int,label]  while accessing a cell value 
#and for range of values we can use iloc or loc
for i in range(pf.shape[0]):
    pf.iloc[i,3] = pf.iloc[i,3]*2

In [30]:
pf

     name         city  age  pyscore
0  Xavier  Mexico City   41    176.0
1     Ann      Toronto   42    158.0
2    Jana       Prague   33    162.0
3      Yi     Shanghai   34    160.0
4   Robin   Manchester   38    136.0
5    Amal        Cairo   31    122.0
6    Nori        Osaka   37    168.0

In [31]:
pf.at[1,"name"]

'Ann'

In [32]:
import pandas as pd
df_india = pd.DataFrame({"city":["mumbai","bangalore","delhi"],
                         "population":[20,10,5]})
df_usa = pd.DataFrame({"city":["newyork","chikago","Los angeles"],
                         "population":[9,5,4]})

df = pd.concat([df_india,df_usa],join = "outer",keys = ["India","USA"],ignore_index=False,axis = 0)
df

                city  population
India 0       mumbai          20
      1    bangalore          10
      2        delhi           5
USA   0      newyork           9
      1      chikago           5
      2  Los angeles           4

In [33]:
df.loc["India"]

        city  population
0     mumbai          20
1  bangalore          10
2      delhi           5

In [34]:
df_indi = pd.DataFrame({"city":["bangalore","mumbai","delhi"],
                         "dummy":[30,3,5]})
df_indi

        city  dummy
0  bangalore     30
1     mumbai      3
2      delhi      5

In [35]:
dfi = pd.concat([df_india,df_indi],join = "inner",axis = 1)
dfi

        city  population       city  dummy
0     mumbai          20  bangalore     30
1  bangalore          10     mumbai      3
2      delhi           5      delhi      5

Inner Join

In [36]:
merged_df = pd.merge(df_india,df_indi)
merged_df

        city  population  dummy
0     mumbai          20      3
1  bangalore          10     30
2      delhi           5      5

Left Join

In [37]:
df_indi = pd.DataFrame({"city":["bangalore","Kolkata","delhi"],
                         "dummy":[30,3,5]})
df_indi

        city  dummy
0  bangalore     30
1    Kolkata      3
2      delhi      5

In [38]:
merged_df = pd.merge(df_india,df_indi,how="left")
merged_df

        city  population  dummy
0     mumbai          20    NaN
1  bangalore          10   30.0
2      delhi           5    5.0

Right join

In [39]:
merged_df = pd.merge(df_india,df_indi,how="right")
merged_df

        city  population  dummy
0  bangalore        10.0     30
1    Kolkata         NaN      3
2      delhi         5.0      5

Outer Join

In [42]:
merged_df = pd.merge(df_india,df_indi,how="outer")
merged_df

        city  population  dummy
0     mumbai        20.0    NaN
1  bangalore        10.0   30.0
2      delhi         5.0    5.0
3    Kolkata         NaN    3.0

Handling Missing Values

In [43]:
df = pd.read_csv("Weather.csv")
df

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
1  01-02-2017     -99999.0        7.0  Sunny
2  01-03-2017         28.0   -99999.0   Snow
3  01-04-2017     -99999.0        7.0      0
4  01-05-2017          NaN   -99999.0   Rain
5  01-06-2017         31.0        NaN  Sunny
6  01-06-2017         34.0        5.0      0

In [44]:
import numpy as np
d = df.replace([-99999,"0"],np.NaN)
d

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
1  01-02-2017          NaN        7.0  Sunny
2  01-03-2017         28.0        NaN   Snow
3  01-04-2017          NaN        7.0    NaN
4  01-05-2017          NaN        NaN   Rain
5  01-06-2017         31.0        NaN  Sunny
6  01-06-2017         34.0        5.0    NaN